In [24]:
import pandas as pd

In [25]:
df = pd.DataFrame({
    "salary": [3000, 3200, 3100, 3050, 100000, 20000, 30000, 40000, 5500, 10000]
})

In [26]:
df['position'] = ['teacher', 'plumber', 'driver', 'lawyer', 'policeman', 'president', 'designer', 'singer', 'dancer', 'cook']
df['annual_salary'] = df['salary']*12

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   salary         10 non-null     int64
 1   position       10 non-null     object
 2   annual_salary  10 non-null     int64
dtypes: int64(2), object(1)
memory usage: 372.0+ bytes

In [28]:
print(type(df['salary'][0]))

<class 'numpy.int64'>

In [29]:
low_salary = []

for i in df['salary']:
    if i < 20000:
        low_salary.append(i)

print(low_salary)

[3000, 3200, 3100, 3050, 5500, 10000]

In [31]:
df.head(15)

   salary   position  annual_salary
0    3000    teacher          36000
1    3200    plumber          38400
2    3100     driver          37200
3    3050     lawyer          36600
4  100000  policeman        1200000
5   20000  president         240000
6   30000   designer         360000
7   40000     singer         480000
8    5500     dancer          66000
9   10000       cook         120000